event-post-api/app/controllers/application_controller.rb

  def authenticate_user
    token = request.headers['Authorization']&.split(' ')&.last
    if token.present?
      begin
        payload = JWT.decode(token, 'your_secret_key', true, algorithm: 'HS256')[0]
        @current_user = User.find_by(id: payload['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]