event-post/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "thumbnail", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
      def create
        user = User.new(user_params)
        if user.save

UPDATE "users" SET "password_digest" = ?, "description" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["description", "最高じゃない!!!!"], ["updated_at", "2024-10-24 01:00:29.383248"], ["id", 3]]
---
      def update
        if @user.update(user_params)