event-post-api/app/controllers/api/v1/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ?  [["event_id", 1]]
---
      def index
        comments = @event.comments.includes(:user).order(created_at: :desc) # ユーザーを事前ロード
        render json: comments.map { |comment| format_comment(comment) }, status: :ok

INSERT INTO "comments" ("content", "event_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["content", "コメント"], ["event_id", 2], ["user_id", 1], ["created_at", "2024-11-10 11:40:10.438382"], ["updated_at", "2024-11-10 11:40:10.438382"]]
---
      def create
        comment = current_user.comments.build(comment_params.merge(event_id: params[:event_id]))
        if comment.save

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
      def destroy
        if @comment.user == current_user
          @comment.destroy

SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ? AND "comments"."id" = ? LIMIT ?  [["event_id", 1], ["id", 2], ["LIMIT", 1]]
---
      def set_comment
        @comment = @event.comments.find(params[:id])