event-post-api/app/controllers/api/v1/events_controller.rb

      def user_liked
        user = User.find_by(id: params[:user_id])
        return render json: { error: 'User not found' }, status: :not_found unless user

        liked_events = user.liked_events.includes(:user).order(created_at: :desc)
        render json: liked_events.map { |event| event_info_with_user(event) }
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."event_id" = ?  [["event_id", 1]]