event-post-api/app/controllers/api/v1/events_controller.rb

INSERT INTO "events" ("title", "date", "location", "description", "price", "user_id", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
      def create
        event = current_user.events.build(event_params)
        if event.save