event-post-api/app/controllers/api/v1/sessions_controller.rb

      def create
        puts '====== sessions ======='
        user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "[FILTERED]"], ["LIMIT", 1]]