event-post-api/app/controllers/api/v1/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]
---
      def destroy
        if current_user&.id == params[:id].to_i
          current_user.destroy