event-post-api/app/controllers/api/v1/users_controller.rb

      def index
        users = User.all.map { |user| user_info_with_thumbnail(user) }
---
SELECT "users".* FROM "users"

      def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "thumbnail", "description", "created_at", "updated_at", "authentication_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

      def update
        @user = User.find_by(id: params[:id]) # ✅ ここで @user を定義
        if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "description" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["description", "最高じゃない!!!!"], ["updated_at", "2024-10-24 01:00:29.383248"], ["id", 3]]

      def destroy
        if current_user&.id == params[:id].to_i
          if current_user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]